import React from 'react'
import Title from '../components/Title'
import { assets } from '../assets/assets'
import NewsLetterBox from '../components/NewsLetterBox'

const Aboute = () => {
  return (
    <div>
      <div className='text-2xl text-center pt-8 border-t'>
        <Title text1={'نــــــبذة'} text2={'عنــــا'}/>
      </div>

      <div className='my-10 flex flex-col md:flex-row gap-16'>
        <img className='w-full md:max-w-[450px]' src={assets.about} alt="" />
        <div className='flex flex-col justify-center gap-6 md:w-2/4 text-gray-600'>
          <p>متجر حلم السودانيين موقع ويب يتيح للمستخدمين تصفح المنتجات والخدمات وشرائها عبر الإنترنت
متجر بمواصفات تقليدية يعمل في بيئة رقمية، مما يسمح للعملاء بالتسوق من أي مكان وفي أي وقت.
يتميز المتجر الإلكتروني بسهولة الوصول إليه، وتوفير مجموعة واسعة من المنتجات، وتقديم تجربة تسوق مريحة.</p>
          <p>متجر حلم السودانيين موقع ويب يتيح للمستخدمين تصفح المنتجات والخدمات وشرائها عبر الإنترنت
متجر بمواصفات تقليدية يعمل في بيئة رقمية، مما يسمح للعملاء بالتسوق من أي مكان وفي أي وقت.
يتميز المتجر الإلكتروني بسهولة الوصول إليه، وتوفير مجموعة واسعة من المنتجات، وتقديم تجربة تسوق مريحة.</p>
          <b>هدفــــــنا</b>
          <p>متجر حلم السودانيين موقع ويب يتيح للمستخدمين تصفح المنتجات والخدمات وشرائها عبر الإنترنت
متجر بمواصفات تقليدية يعمل في بيئة رقمية، مما يسمح للعملاء بالتسوق من أي مكان وفي أي وقت.
يتميز المتجر الإلكتروني بسهولة الوصول إليه، وتوفير مجموعة واسعة من المنتجات، وتقديم تجربة تسوق مريحة.</p>
        </div>
      </div>
      <div className='text-4xl py-4'>
        <Title text1={'لــــــماذا'} text2={'نحن'}/>
      </div>
      <div className='flex flex-col md:flex-row text-sm mb-20'>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>ضــــــمــــان الجودة</b>
          <p className='text-gray-600'>متجر حلم السودانيين موقع ويب يتيح للمستخدمين تصفح المنتجات والخدمات وشرائها عبر الإنترنت
متجر بمواصفات تقليدية يعمل في بيئة رقمية، مما يسمح للعملاء بالتسوق من أي مكان وفي أي وقت.
يتميز المتجر الإلكتروني بسهولة الوصول إليه، وتوفير مجموعة واسعة من المنتجات، وتقديم تجربة تسوق مريحة.</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>مــــــتعة التسوق</b>
          <p className='text-gray-600'>متجر حلم السودانيين موقع ويب يتيح للمستخدمين تصفح المنتجات والخدمات وشرائها عبر الإنترنت
متجر بمواصفات تقليدية يعمل في بيئة رقمية، مما يسمح للعملاء بالتسوق من أي مكان وفي أي وقت.
يتميز المتجر الإلكتروني بسهولة الوصول إليه، وتوفير مجموعة واسعة من المنتجات، وتقديم تجربة تسوق مريحة.</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>خـــــدمة عملاء متميزة</b>
          <p className='text-gray-600'>متجر حلم السودانيين موقع ويب يتيح للمستخدمين تصفح المنتجات والخدمات وشرائها عبر الإنترنت
متجر بمواصفات تقليدية يعمل في بيئة رقمية، مما يسمح للعملاء بالتسوق من أي مكان وفي أي وقت.
يتميز المتجر الإلكتروني بسهولة الوصول إليه، وتوفير مجموعة واسعة من المنتجات، وتقديم تجربة تسوق مريحة.</p>
        </div>
      </div>
      <NewsLetterBox />
    </div>
  )
}

export default Aboute